
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: FortniteAI
/// dependency: FortniteGame
/// dependency: GameplayAbilities
/// dependency: GameplayEffectTemplates
/// dependency: IrwinRuntime
/// dependency: NavigationSystem

/// Class /Game/AI/NavAreas/FortNavArea_JumpDownSmashable3.FortNavArea_JumpDownSmashable3_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UFortNavArea_JumpDownSmashable3_C : public UFortNavArea_SmashableJump
{ 
public:
};

/// Class /Game/AI/AIBlueprintInterface/BPI_HuskDance.BPI_HuskDance_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_HuskDance_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/AI/AIBlueprintInterface/BPI_HuskDance.BPI_HuskDance_C.OnEndDance
	// void OnEndDance();                                                                                                    // [0x18a39e4] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/AI/AIBlueprintInterface/BPI_HuskDance.BPI_HuskDance_C.OnBeginDance
	// void OnBeginDance();                                                                                                  // [0x18a39e4] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/AI/NavAreas/FortNavArea_JumpDownSmashable2.FortNavArea_JumpDownSmashable2_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UFortNavArea_JumpDownSmashable2_C : public UFortNavArea_SmashableJump
{ 
public:
};

/// Class /Game/AI/NavAreas/FortNavArea_JumpDownSmashable.FortNavArea_JumpDownSmashable_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UFortNavArea_JumpDownSmashable_C : public UFortNavArea_SmashableJump
{ 
public:
};

/// Class /Game/AI/NavAreas/FortNavArea_JumpDown.FortNavArea_JumpDown_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UFortNavArea_JumpDown_C : public UFortNavArea
{ 
public:
};

/// Class /Irwin/AI/Interfaces/Fauna_Idle_AnimInterface.Fauna_Idle_AnimInterface_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UFauna_Idle_AnimInterface_C : public UAnimLayerInterface
{ 
public:


	/// Functions
	// Function /Irwin/AI/Interfaces/Fauna_Idle_AnimInterface.Fauna_Idle_AnimInterface_C.Fauna IdleTurn
	// void Fauna IdleTurn(FPoseLink InPose IdleTurn, FPoseLink& Fauna IdleTurn);                                            // [0x18a39e4] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Interfaces/Fauna_Idle_AnimInterface.Fauna_Idle_AnimInterface_C.Fauna Idle
	// void Fauna Idle(FPoseLink InPose Idle, FPoseLink& Fauna Idle);                                                        // [0x18a39e4] HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Struct /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0067 (0x000001 - 0x000068)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	bool                                               __BoolProperty0;                                            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              __FloatProperty1;                                           // 0x000C   (0x0004)  
	float                                              __FloatProperty2;                                           // 0x0010   (0x0004)  
	float                                              __FloatProperty3;                                           // 0x0014   (0x0004)  
	bool                                               __BoolProperty4;                                            // 0x0018   (0x0001)  
	bool                                               __BoolProperty5;                                            // 0x0019   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x001A   (0x0002)  MISSED
	float                                              __FloatProperty6;                                           // 0x001C   (0x0004)  
	float                                              __FloatProperty7;                                           // 0x0020   (0x0004)  
	float                                              __FloatProperty8;                                           // 0x0024   (0x0004)  
	bool                                               __BoolProperty9;                                            // 0x0028   (0x0001)  
	bool                                               __BoolProperty10;                                           // 0x0029   (0x0001)  
	bool                                               __BoolProperty11;                                           // 0x002A   (0x0001)  
	bool                                               __BoolProperty12;                                           // 0x002B   (0x0001)  
	bool                                               __BoolProperty13;                                           // 0x002C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x002D   (0x0003)  MISSED
	float                                              __FloatProperty14;                                          // 0x0030   (0x0004)  
	bool                                               __BoolProperty15;                                           // 0x0034   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	float                                              __FloatProperty16;                                          // 0x0038   (0x0004)  
	float                                              __FloatProperty17;                                          // 0x003C   (0x0004)  
	bool                                               __BoolProperty18;                                           // 0x0040   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              __FloatProperty19;                                          // 0x0044   (0x0004)  
	bool                                               __BoolProperty20;                                           // 0x0048   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	float                                              __FloatProperty21;                                          // 0x004C   (0x0004)  
	float                                              __FloatProperty22;                                          // 0x0050   (0x0004)  
	float                                              __FloatProperty23;                                          // 0x0054   (0x0004)  
	bool                                               __BoolProperty24;                                           // 0x0058   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              __FloatProperty25;                                          // 0x005C   (0x0004)  
	float                                              __FloatProperty26;                                          // 0x0060   (0x0004)  
	float                                              __FloatProperty27;                                          // 0x0064   (0x0004)  
};

/// Class /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C
/// Size: 0x4340 (0x0007C0 - 0x004B00)
class UBurt_AnimBP_C : public UFortAIFaunaAnimInstance_Burt
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x07C0   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x07C8   (0x0068)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0830   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0838   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0840   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0860   (0x00B0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0910   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0958   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer0;                              // 0x09A0   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root1;                                        // 0x09E8   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose2;                             // 0x0A08   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer3;                              // 0x0AB8   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root4;                                        // 0x0B00   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0B20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0B48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult6;                            // 0x0B70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult7;                            // 0x0B98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult8;                            // 0x0BC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x0BE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x0C10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x0C38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x0C60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0C88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x0CB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x0CD8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x0D00   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult17;                           // 0x0D28   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult18;                           // 0x0D50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x0D78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x0DA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult21;                           // 0x0DC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult22;                           // 0x0DF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult23;                           // 0x0E18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult24;                           // 0x0E40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult25;                           // 0x0E68   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer26;                             // 0x0E90   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0ED8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer27;                             // 0x0EF8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult28;                                // 0x0F40   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer29;                             // 0x0F60   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult30;                                // 0x0FA8   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0FC8   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x1038   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer31;                             // 0x1100   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer32;                             // 0x1148   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool33;                            // 0x1190   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult34;                                // 0x11D8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer35;                             // 0x11F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult36;                                // 0x1240   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer37;                             // 0x1260   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult38;                                // 0x12A8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x12C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x1310   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult41;                           // 0x1330   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult42;                           // 0x1358   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer43;                             // 0x1380   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult44;                                // 0x13C8   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x13E8   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult45;                                // 0x13F8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1418   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive46;                              // 0x14E0   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive47;                              // 0x15A8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer48;                           // 0x1670   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer49;                           // 0x16E0   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult50;                                // 0x1750   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1770   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool51;                            // 0x1798   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x17E0   (0x00F0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool52;                            // 0x18D0   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose53;                              // 0x1918   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer54;                             // 0x1940   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer55;                             // 0x1988   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive56;                              // 0x19D0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer57;                           // 0x1A98   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult58;                                // 0x1B08   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine59;                               // 0x1B28   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1BF0   (0x0048)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1C38   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1C58   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot60;                                       // 0x1C78   (0x0048)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1CC0   (0x0100)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive61;                              // 0x1DC0   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult62;                           // 0x1E88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult63;                           // 0x1EB0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer64;                             // 0x1ED8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult65;                                // 0x1F20   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose66;                               // 0x1F40   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult67;                                // 0x1F50   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine68;                               // 0x1F70   (0x00C8)  
	FFortAnimNode_QuadrupedSlopeWarping                FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x2038   (0x05C8)  
	FFortAnimNode_WeightedLookAt                       FortAnimGraphNode_WeightedLookAt;                           // 0x2600   (0x0250)  
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x2850   (0x0420)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer;                              // 0x2C70   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x2D38   (0x0078)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool69;                            // 0x2DB0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer70;                             // 0x2DF8   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool71;                            // 0x2E40   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult72;                           // 0x2E88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult73;                           // 0x2EB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult74;                           // 0x2ED8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult75;                           // 0x2F00   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult76;                           // 0x2F28   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult77;                           // 0x2F50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult78;                           // 0x2F78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult79;                           // 0x2FA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult80;                           // 0x2FC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult81;                           // 0x2FF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult82;                           // 0x3018   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult83;                           // 0x3040   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult84;                           // 0x3068   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x3090   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult86;                           // 0x30B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult87;                           // 0x30E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult88;                           // 0x3108   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult89;                           // 0x3130   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool90;                            // 0x3158   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer91;                             // 0x31A0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer92;                             // 0x31E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult93;                                // 0x3230   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult94;                           // 0x3250   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult95;                           // 0x3278   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult96;                           // 0x32A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult97;                           // 0x32C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult98;                           // 0x32F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult99;                           // 0x3318   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult100;                          // 0x3340   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult101;                          // 0x3368   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer102;                            // 0x3390   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult103;                               // 0x33D8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer104;                            // 0x33F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult105;                               // 0x3440   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer106;                            // 0x3460   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult107;                               // 0x34A8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer108;                            // 0x34C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult109;                               // 0x3510   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult110;                          // 0x3530   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine111;                              // 0x3558   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult112;                               // 0x3620   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer113;                            // 0x3640   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult114;                               // 0x3688   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer115;                            // 0x36A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult116;                               // 0x36F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer117;                            // 0x3710   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult118;                               // 0x3758   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult119;                          // 0x3778   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine120;                              // 0x37A0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult121;                               // 0x3868   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer122;                            // 0x3888   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer123;                            // 0x38D0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool124;                           // 0x3918   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult125;                               // 0x3960   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool126;                           // 0x3980   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer127;                            // 0x39C8   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer128;                          // 0x3A10   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive129;                             // 0x3A80   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer130;                            // 0x3B48   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer131;                            // 0x3B90   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool132;                           // 0x3BD8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult133;                               // 0x3C20   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer134;                            // 0x3C40   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer135;                          // 0x3C88   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive136;                             // 0x3CF8   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool137;                           // 0x3DC0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer138;                            // 0x3E08   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult139;                               // 0x3E50   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer140;                            // 0x3E70   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult141;                               // 0x3EB8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer142;                            // 0x3ED8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult143;                               // 0x3F20   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer144;                          // 0x3F40   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive145;                             // 0x3FB0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer146;                            // 0x4078   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool147;                           // 0x40C0   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer148;                          // 0x4108   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive149;                             // 0x4178   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer150;                            // 0x4240   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool151;                           // 0x4288   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult152;                          // 0x42D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult153;                          // 0x42F8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer154;                            // 0x4320   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult155;                               // 0x4368   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose156;                              // 0x4388   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult157;                               // 0x4398   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine158;                              // 0x43B8   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive159;                             // 0x4480   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive160;                             // 0x4548   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer161;                          // 0x4610   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer162;                          // 0x4680   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult163;                               // 0x46F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer164;                            // 0x4710   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult165;                               // 0x4758   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine166;                              // 0x4778   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot167;                                      // 0x4840   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive168;                             // 0x4888   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult169;                          // 0x4950   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult170;                          // 0x4978   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer171;                            // 0x49A0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult172;                               // 0x49E8   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose173;                              // 0x4A08   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult174;                               // 0x4A18   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine175;                              // 0x4A38   (0x00C8)  


	/// Functions
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.Fauna IdleTurn
	// void Fauna IdleTurn(FPoseLink InPose IdleTurn, FPoseLink& Fauna IdleTurn);                                            // [0x18a39e4] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.Fauna Idle
	// void Fauna Idle(FPoseLink InPose Idle, FPoseLink& Fauna Idle);                                                        // [0x18a39e4] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x18a39e4] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3(); // [0x18a39e4] BlueprintEvent       
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_FallExit
	// void AnimNotify_FallExit();                                                                                           // [0x18a39e4] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandAddExit
	// void AnimNotify_LandAddExit();                                                                                        // [0x18a39e4] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandEnter
	// void AnimNotify_LandEnter();                                                                                          // [0x18a39e4] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.ExecuteUbergraph_Burt_AnimBP
	// void ExecuteUbergraph_Burt_AnimBP(int32_t EntryPoint);                                                                // [0x18a39e4] Final                
};

/// Class /Irwin/AI/Interfaces/Fauna_Jump_AnimInterface.Fauna_Jump_AnimInterface_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UFauna_Jump_AnimInterface_C : public UAnimLayerInterface
{ 
public:


	/// Functions
	// Function /Irwin/AI/Interfaces/Fauna_Jump_AnimInterface.Fauna_Jump_AnimInterface_C.Fauna Jump
	// void Fauna Jump(FPoseLink& Fauna Jump);                                                                               // [0x18a39e4] HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C
/// Size: 0x4B90 (0x0007E0 - 0x005370)
class UGrandma_AnimBP_C : public UFortAIFaunaAnimInstance_Grandma
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x07D8   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x07E0   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x07E8   (0x0074)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x085C   (0x0004)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0860   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0868   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0870   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0890   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x08B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x08E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0908   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x0930   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x0958   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0980   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x09A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x09F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer6;                              // 0x0A10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult7;                                 // 0x0A58   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer8;                              // 0x0A78   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult9;                                 // 0x0AC0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer10;                             // 0x0AE0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult11;                                // 0x0B28   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0B48   (0x00C8)  
	FAnimNode_Root                                     AnimGraphNode_Root12;                                       // 0x0C10   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0C30   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer13;                             // 0x0CE0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer14;                             // 0x0D28   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0D70   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root15;                                       // 0x0DB8   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose16;                            // 0x0DD8   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x0E88   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root18;                                       // 0x0ED0   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x0EF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x0F18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult21;                           // 0x0F40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult22;                           // 0x0F68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult23;                           // 0x0F90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult24;                           // 0x0FB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult25;                           // 0x0FE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult26;                           // 0x1008   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult27;                           // 0x1030   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult28;                           // 0x1058   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult29;                           // 0x1080   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult30;                           // 0x10A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult31;                           // 0x10D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult32;                           // 0x10F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult33;                           // 0x1120   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult34;                           // 0x1148   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult35;                           // 0x1170   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult36;                           // 0x1198   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult37;                           // 0x11C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult38;                           // 0x11E8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x1210   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x1258   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer41;                             // 0x1278   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult42;                                // 0x12C0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer43;                             // 0x12E0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult44;                                // 0x1328   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer45;                             // 0x1348   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult46;                                // 0x1390   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer47;                             // 0x13B0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult48;                                // 0x13F8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer49;                             // 0x1418   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult50;                                // 0x1460   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x1480   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x1548   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool51;                            // 0x15B8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer52;                             // 0x1600   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer53;                             // 0x1648   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult54;                                // 0x1690   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive55;                              // 0x16B0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer56;                           // 0x1778   (0x0070)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult57;                           // 0x17E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult58;                           // 0x1810   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer59;                             // 0x1838   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult60;                                // 0x1880   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x18A0   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult61;                                // 0x18B0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine62;                               // 0x18D0   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive63;                              // 0x1998   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer64;                           // 0x1A60   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult65;                                // 0x1AD0   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer66;                           // 0x1AF0   (0x0070)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer67;                             // 0x1B60   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer68;                             // 0x1BA8   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1BF0   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool69;                            // 0x1C18   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1C60   (0x00F0)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive70;                              // 0x1D50   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool71;                            // 0x1E18   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose72;                              // 0x1E60   (0x0028)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult73;                                // 0x1E88   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine74;                               // 0x1EA8   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1F70   (0x0048)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1FB8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1FD8   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot75;                                       // 0x1FF8   (0x0048)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x2040   (0x0100)  
	FAnimNode_Slot                                     AnimGraphNode_Slot76;                                       // 0x2140   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot77;                                       // 0x2188   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x21D0   (0x0078)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose78;                              // 0x2248   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose79;                              // 0x2270   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool80;                            // 0x2298   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend81;                           // 0x22E0   (0x00F0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose82;                              // 0x23D0   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot83;                                       // 0x23F8   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive84;                              // 0x2440   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x2508   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult86;                           // 0x2530   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult87;                           // 0x2558   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult88;                           // 0x2580   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer89;                             // 0x25A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult90;                                // 0x25F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer91;                             // 0x2610   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult92;                                // 0x2658   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose93;                               // 0x2678   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult94;                                // 0x2688   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine95;                               // 0x26A8   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer96;                             // 0x2770   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend97;                           // 0x27B8   (0x00F0)  
	FFortAnimNode_QuadrupedSlopeWarping                FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x28A8   (0x05C8)  
	FFortAnimNode_WeightedLookAt                       FortAnimGraphNode_WeightedLookAt;                           // 0x2E70   (0x0250)  
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x30C0   (0x0420)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer;                              // 0x34E0   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose98;                             // 0x35A8   (0x0078)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer99;                             // 0x3620   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool100;                           // 0x3668   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult101;                          // 0x36B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult102;                          // 0x36D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult103;                          // 0x3700   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult104;                          // 0x3728   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult105;                          // 0x3750   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult106;                          // 0x3778   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult107;                          // 0x37A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult108;                          // 0x37C8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult109;                          // 0x37F0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult110;                          // 0x3818   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult111;                          // 0x3840   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult112;                          // 0x3868   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult113;                          // 0x3890   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult114;                          // 0x38B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult115;                          // 0x38E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult116;                          // 0x3908   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult117;                          // 0x3930   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult118;                          // 0x3958   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer119;                            // 0x3980   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer120;                            // 0x39C8   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool121;                           // 0x3A10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult122;                               // 0x3A58   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer123;                            // 0x3A78   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer124;                            // 0x3AC0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool125;                           // 0x3B08   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult126;                               // 0x3B50   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult127;                          // 0x3B70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult128;                          // 0x3B98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult129;                          // 0x3BC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult130;                          // 0x3BE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult131;                          // 0x3C10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult132;                          // 0x3C38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult133;                          // 0x3C60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult134;                          // 0x3C88   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer135;                            // 0x3CB0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult136;                               // 0x3CF8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer137;                            // 0x3D18   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult138;                               // 0x3D60   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer139;                            // 0x3D80   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult140;                               // 0x3DC8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer141;                            // 0x3DE8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult142;                               // 0x3E30   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult143;                          // 0x3E50   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine144;                              // 0x3E78   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult145;                               // 0x3F40   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer146;                            // 0x3F60   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult147;                               // 0x3FA8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer148;                            // 0x3FC8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult149;                               // 0x4010   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer150;                            // 0x4030   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult151;                               // 0x4078   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult152;                          // 0x4098   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine153;                              // 0x40C0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult154;                               // 0x4188   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer155;                            // 0x41A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult156;                               // 0x41F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer157;                            // 0x4210   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive158;                             // 0x4258   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer159;                          // 0x4320   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool160;                           // 0x4390   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer161;                            // 0x43D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult162;                               // 0x4420   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer163;                            // 0x4440   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult164;                               // 0x4488   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer165;                            // 0x44A8   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool166;                           // 0x44F0   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive167;                             // 0x4538   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer168;                          // 0x4600   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool169;                           // 0x4670   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer170;                            // 0x46B8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer171;                            // 0x4700   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult172;                               // 0x4748   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive173;                             // 0x4768   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer174;                          // 0x4830   (0x0070)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer175;                            // 0x48A0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool176;                           // 0x48E8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer177;                            // 0x4930   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool178;                           // 0x4978   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive179;                             // 0x49C0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer180;                          // 0x4A88   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive181;                             // 0x4AF8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer182;                          // 0x4BC0   (0x0070)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult183;                          // 0x4C30   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult184;                          // 0x4C58   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer185;                            // 0x4C80   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult186;                               // 0x4CC8   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose187;                              // 0x4CE8   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult188;                               // 0x4CF8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine189;                              // 0x4D18   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive190;                             // 0x4DE0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer191;                          // 0x4EA8   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult192;                               // 0x4F18   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer193;                            // 0x4F38   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult194;                               // 0x4F80   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine195;                              // 0x4FA0   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool196;                           // 0x5068   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot197;                                      // 0x50B0   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive198;                             // 0x50F8   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult199;                          // 0x51C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult200;                          // 0x51E8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer201;                            // 0x5210   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult202;                               // 0x5258   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose203;                              // 0x5278   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult204;                               // 0x5288   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine205;                              // 0x52A8   (0x00C8)  


	/// Functions
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna Jump
	// void Fauna Jump(FPoseLink& Fauna Jump);                                                                               // [0x18a39e4] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna IdleTurn
	// void Fauna IdleTurn(FPoseLink InPose IdleTurn, FPoseLink& Fauna IdleTurn);                                            // [0x18a39e4] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna Idle
	// void Fauna Idle(FPoseLink InPose Idle, FPoseLink& Fauna Idle);                                                        // [0x18a39e4] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x18a39e4] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_FallExit
	// void AnimNotify_FallExit();                                                                                           // [0x18a39e4] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandAddExit
	// void AnimNotify_LandAddExit();                                                                                        // [0x18a39e4] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandEnter
	// void AnimNotify_LandEnter();                                                                                          // [0x18a39e4] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.ExecuteUbergraph_Grandma_AnimBP
	// void ExecuteUbergraph_Grandma_AnimBP(int32_t EntryPoint);                                                             // [0x18a39e4] Final                
};

/// Class /Irwin/AI/Prey/Burt/Abilities/GE_RidingSprint_PawnDmg.GE_RidingSprint_PawnDmg_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_RidingSprint_PawnDmg_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Class /Irwin/AI/Prey/Burt/Abilities/GE_NPC_Irwn_Prey_Burt_DiscoverLootCooldown.GE_NPC_Irwn_Prey_Burt_DiscoverLootCooldown_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_Irwn_Prey_Burt_DiscoverLootCooldown_C : public UGameplayEffect
{ 
public:
};

/// Class /Irwin/AI/Prey/Burt/Abilities/GE_RidingSprint_VehicleDmg.GE_RidingSprint_VehicleDmg_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_RidingSprint_VehicleDmg_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Struct /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x2727 (0x000001 - 0x002728)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0004)  
	FName                                              __NameProperty0;                                            // 0x0008   (0x0004)  
	FName                                              __NameProperty1;                                            // 0x000C   (0x0004)  
	FName                                              __NameProperty2;                                            // 0x0010   (0x0004)  
	FName                                              __NameProperty3;                                            // 0x0014   (0x0004)  
	FName                                              __NameProperty4;                                            // 0x0018   (0x0004)  
	FName                                              __NameProperty5;                                            // 0x001C   (0x0004)  
	FName                                              __NameProperty6;                                            // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	FName                                              __NameProperty7;                                            // 0x0038   (0x0004)  
	FName                                              __NameProperty8;                                            // 0x003C   (0x0004)  
	TArray<float>                                      __ArrayProperty9;                                           // 0x0040   (0x0010)  
	float                                              __FloatProperty;                                            // 0x0050   (0x0004)  
	FName                                              __NameProperty10;                                           // 0x0054   (0x0004)  
	int32_t                                            __IntProperty;                                              // 0x0058   (0x0004)  
	FName                                              __NameProperty11;                                           // 0x005C   (0x0004)  
	FName                                              __NameProperty12;                                           // 0x0060   (0x0004)  
	FName                                              __NameProperty13;                                           // 0x0064   (0x0004)  
	FName                                              __NameProperty14;                                           // 0x0068   (0x0004)  
	FName                                              __NameProperty15;                                           // 0x006C   (0x0004)  
	FName                                              __NameProperty16;                                           // 0x0070   (0x0004)  
	FName                                              __NameProperty17;                                           // 0x0074   (0x0004)  
	FName                                              __NameProperty18;                                           // 0x0078   (0x0004)  
	FName                                              __NameProperty19;                                           // 0x007C   (0x0004)  
	int32_t                                            __IntProperty20;                                            // 0x0080   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0084   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty21;                                          // 0x0088   (0x0010)  
	FName                                              __NameProperty22;                                           // 0x0098   (0x0004)  
	int32_t                                            __IntProperty23;                                            // 0x009C   (0x0004)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00A1   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty24;                                          // 0x00A8   (0x0010)  
	TArray<float>                                      __ArrayProperty25;                                          // 0x00B8   (0x0010)  
	FName                                              __NameProperty26;                                           // 0x00C8   (0x0004)  
	int32_t                                            __IntProperty27;                                            // 0x00CC   (0x0004)  
	FName                                              __NameProperty28;                                           // 0x00D0   (0x0004)  
	int32_t                                            __IntProperty29;                                            // 0x00D4   (0x0004)  
	FName                                              __NameProperty30;                                           // 0x00D8   (0x0004)  
	int32_t                                            __IntProperty31;                                            // 0x00DC   (0x0004)  
	FName                                              __NameProperty32;                                           // 0x00E0   (0x0004)  
	int32_t                                            __IntProperty33;                                            // 0x00E4   (0x0004)  
	TArray<float>                                      __ArrayProperty34;                                          // 0x00E8   (0x0010)  
	class UBlendProfile*                               __BlendProfile;                                             // 0x00F8   (0x0008)  
	class UCurveFloat*                                 __CurveFloat;                                               // 0x0100   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty35;                                           // 0x0108   (0x0001)  
	EBlendListTransitionType                           __EnumProperty36;                                           // 0x0109   (0x0001)  
	unsigned char                                      UnknownData04_5[0x6];                                       // 0x010A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty37;                                          // 0x0110   (0x0010)  
	EAnimSyncMethod                                    __EnumProperty38;                                           // 0x0120   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0121   (0x0003)  MISSED
	FName                                              __NameProperty39;                                           // 0x0124   (0x0004)  
	FName                                              __NameProperty40;                                           // 0x0128   (0x0004)  
	FName                                              __NameProperty41;                                           // 0x012C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0130   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0131   (0x0003)  MISSED
	float                                              __FloatProperty42;                                          // 0x0134   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0138   (0x002C)  
	float                                              __FloatProperty43;                                          // 0x0164   (0x0004)  
	bool                                               __BoolProperty44;                                           // 0x0168   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty45;                                           // 0x0169   (0x0001)  
	SDK_UNDEFINED(1,9443) /* TEnumAsByte<EAnimGroupRole> */ __um(__ByteProperty);                                  // 0x016A   (0x0001)  
	unsigned char                                      UnknownData07_5[0x1];                                       // 0x016B   (0x0001)  MISSED
	FName                                              __NameProperty46;                                           // 0x016C   (0x0004)  
	FName                                              __NameProperty47;                                           // 0x0170   (0x0004)  
	int32_t                                            __IntProperty48;                                            // 0x0174   (0x0004)  
	SDK_UNDEFINED(1,9444) /* TEnumAsByte<ERefPoseType> */ __um(__ByteProperty);                                    // 0x0178   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x0179   (0x0003)  MISSED
	FName                                              __NameProperty50;                                           // 0x017C   (0x0004)  
	FName                                              __NameProperty51;                                           // 0x0180   (0x0004)  
	int32_t                                            __IntProperty52;                                            // 0x0184   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty53;                                         // 0x0188   (0x0018)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x01A0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0220   (0x0018)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root;                                         // 0x0238   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedInputPose;                              // 0x0268   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool;                              // 0x0298   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer;                               // 0x02C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer54;                             // 0x02F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root55;                                       // 0x0328   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedInputPose56;                            // 0x0358   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer57;                             // 0x0388   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root58;                                       // 0x03B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult;                             // 0x03E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult59;                           // 0x0418   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult60;                           // 0x0448   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult61;                           // 0x0478   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult62;                           // 0x04A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult63;                           // 0x04D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult64;                           // 0x0508   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult65;                           // 0x0538   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult66;                           // 0x0568   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult67;                           // 0x0598   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult68;                           // 0x05C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult69;                           // 0x05F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult70;                           // 0x0628   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult71;                           // 0x0658   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult72;                           // 0x0688   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult73;                           // 0x06B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult74;                           // 0x06E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult75;                           // 0x0718   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult76;                           // 0x0748   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult77;                           // 0x0778   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult78;                           // 0x07A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult79;                           // 0x07D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer80;                             // 0x0808   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult;                                  // 0x0838   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer81;                             // 0x0868   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult82;                                // 0x0898   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer83;                             // 0x08C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult84;                                // 0x08F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer;                             // 0x0928   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive;                                // 0x0958   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer85;                             // 0x0988   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer86;                             // 0x09B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool87;                            // 0x09E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult88;                                // 0x0A18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer89;                             // 0x0A48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult90;                                // 0x0A78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer91;                             // 0x0AA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult92;                                // 0x0AD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer93;                             // 0x0B08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult94;                                // 0x0B38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult95;                           // 0x0B68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult96;                           // 0x0B98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer97;                             // 0x0BC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult98;                                // 0x0BF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose;                                 // 0x0C28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult99;                                // 0x0C58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine;                                 // 0x0C88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive100;                             // 0x0CB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive101;                             // 0x0CE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer102;                          // 0x0D18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer103;                          // 0x0D48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult104;                               // 0x0D78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose;                                // 0x0DA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool105;                           // 0x0DD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LayeredBoneBlend;                             // 0x0E08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool106;                           // 0x0E38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose107;                             // 0x0E68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer108;                            // 0x0E98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer109;                            // 0x0EC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive110;                             // 0x0EF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer111;                          // 0x0F28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult112;                               // 0x0F58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine113;                              // 0x0F88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot;                                         // 0x0FB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LocalToComponentSpace;                        // 0x0FE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ComponentToLocalSpace;                        // 0x1018   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot114;                                      // 0x1048   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LegIK;                                        // 0x1078   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive115;                             // 0x10A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult116;                          // 0x10D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult117;                          // 0x1108   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer118;                            // 0x1138   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult119;                               // 0x1168   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose120;                              // 0x1198   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult121;                               // 0x11C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine122;                              // 0x11F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x1228   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        FortAnimGraphNode_WeightedLookAt;                           // 0x1258   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Inertialization;                              // 0x1288   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedAnimLayer;                              // 0x12B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SaveCachedPose;                               // 0x12E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool123;                           // 0x1318   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer124;                            // 0x1348   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool125;                           // 0x1378   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult126;                          // 0x13A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult127;                          // 0x13D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult128;                          // 0x1408   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult129;                          // 0x1438   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult130;                          // 0x1468   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult131;                          // 0x1498   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult132;                          // 0x14C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult133;                          // 0x14F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult134;                          // 0x1528   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult135;                          // 0x1558   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult136;                          // 0x1588   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult137;                          // 0x15B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult138;                          // 0x15E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult139;                          // 0x1618   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult140;                          // 0x1648   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult141;                          // 0x1678   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult142;                          // 0x16A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult143;                          // 0x16D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool144;                           // 0x1708   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer145;                            // 0x1738   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer146;                            // 0x1768   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult147;                               // 0x1798   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult148;                          // 0x17C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult149;                          // 0x17F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult150;                          // 0x1828   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult151;                          // 0x1858   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult152;                          // 0x1888   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult153;                          // 0x18B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult154;                          // 0x18E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult155;                          // 0x1918   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer156;                            // 0x1948   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult157;                               // 0x1978   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer158;                            // 0x19A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult159;                               // 0x19D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer160;                            // 0x1A08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult161;                               // 0x1A38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer162;                            // 0x1A68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult163;                               // 0x1A98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult164;                          // 0x1AC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine165;                              // 0x1AF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult166;                               // 0x1B28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer167;                            // 0x1B58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult168;                               // 0x1B88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer169;                            // 0x1BB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult170;                               // 0x1BE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer171;                            // 0x1C18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult172;                               // 0x1C48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult173;                          // 0x1C78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine174;                              // 0x1CA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult175;                               // 0x1CD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer176;                            // 0x1D08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer177;                            // 0x1D38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool178;                           // 0x1D68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult179;                               // 0x1D98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool180;                           // 0x1DC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer181;                            // 0x1DF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer182;                          // 0x1E28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive183;                             // 0x1E58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer184;                            // 0x1E88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer185;                            // 0x1EB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool186;                           // 0x1EE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult187;                               // 0x1F18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer188;                            // 0x1F48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer189;                          // 0x1F78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive190;                             // 0x1FA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool191;                           // 0x1FD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer192;                            // 0x2008   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult193;                               // 0x2038   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer194;                            // 0x2068   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult195;                               // 0x2098   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer196;                            // 0x20C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult197;                               // 0x20F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer198;                          // 0x2128   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive199;                             // 0x2158   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer200;                            // 0x2188   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool201;                           // 0x21B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer202;                          // 0x21E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive203;                             // 0x2218   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer204;                            // 0x2248   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool205;                           // 0x2278   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult206;                          // 0x22A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult207;                          // 0x22D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer208;                            // 0x2308   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult209;                               // 0x2338   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose210;                              // 0x2368   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult211;                               // 0x2398   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine212;                              // 0x23C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive213;                             // 0x23F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive214;                             // 0x2428   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer215;                          // 0x2458   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer216;                          // 0x2488   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult217;                               // 0x24B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer218;                            // 0x24E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult219;                               // 0x2518   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine220;                              // 0x2548   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot221;                                      // 0x2578   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive222;                             // 0x25A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult223;                          // 0x25D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult224;                          // 0x2608   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer225;                            // 0x2638   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult226;                               // 0x2668   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose227;                              // 0x2698   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult228;                               // 0x26C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine229;                              // 0x26F8   (0x0030)  
};

/// Struct /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x2CE7 (0x000001 - 0x002CE8)
struct FAnimBlueprintGeneratedConstantDatadup_126 : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0004)  
	FName                                              __NameProperty0;                                            // 0x0008   (0x0004)  
	FName                                              __NameProperty1;                                            // 0x000C   (0x0004)  
	FName                                              __NameProperty2;                                            // 0x0010   (0x0004)  
	FName                                              __NameProperty3;                                            // 0x0014   (0x0004)  
	FName                                              __NameProperty4;                                            // 0x0018   (0x0004)  
	FName                                              __NameProperty5;                                            // 0x001C   (0x0004)  
	FName                                              __NameProperty6;                                            // 0x0020   (0x0004)  
	FName                                              __NameProperty7;                                            // 0x0024   (0x0004)  
	FName                                              __NameProperty8;                                            // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0030   (0x0010)  
	TArray<float>                                      __ArrayProperty9;                                           // 0x0040   (0x0010)  
	FName                                              __NameProperty10;                                           // 0x0050   (0x0004)  
	FName                                              __NameProperty11;                                           // 0x0054   (0x0004)  
	FName                                              __NameProperty12;                                           // 0x0058   (0x0004)  
	float                                              __FloatProperty;                                            // 0x005C   (0x0004)  
	TArray<float>                                      __ArrayProperty13;                                          // 0x0060   (0x0010)  
	FName                                              __NameProperty14;                                           // 0x0070   (0x0004)  
	int32_t                                            __IntProperty;                                              // 0x0074   (0x0004)  
	FName                                              __NameProperty15;                                           // 0x0078   (0x0004)  
	int32_t                                            __IntProperty16;                                            // 0x007C   (0x0004)  
	FName                                              __NameProperty17;                                           // 0x0080   (0x0004)  
	FName                                              __NameProperty18;                                           // 0x0084   (0x0004)  
	FName                                              __NameProperty19;                                           // 0x0088   (0x0004)  
	FName                                              __NameProperty20;                                           // 0x008C   (0x0004)  
	FName                                              __NameProperty21;                                           // 0x0090   (0x0004)  
	FName                                              __NameProperty22;                                           // 0x0094   (0x0004)  
	FName                                              __NameProperty23;                                           // 0x0098   (0x0004)  
	FName                                              __NameProperty24;                                           // 0x009C   (0x0004)  
	FName                                              __NameProperty25;                                           // 0x00A0   (0x0004)  
	int32_t                                            __IntProperty26;                                            // 0x00A4   (0x0004)  
	FName                                              __NameProperty27;                                           // 0x00A8   (0x0004)  
	int32_t                                            __IntProperty28;                                            // 0x00AC   (0x0004)  
	float                                              __FloatProperty29;                                          // 0x00B0   (0x0004)  
	FName                                              __NameProperty30;                                           // 0x00B4   (0x0004)  
	int32_t                                            __IntProperty31;                                            // 0x00B8   (0x0004)  
	FName                                              __NameProperty32;                                           // 0x00BC   (0x0004)  
	int32_t                                            __IntProperty33;                                            // 0x00C0   (0x0004)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x00C4   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00C5   (0x0003)  MISSED
	TArray<float>                                      __ArrayProperty34;                                          // 0x00C8   (0x0010)  
	TArray<float>                                      __ArrayProperty35;                                          // 0x00D8   (0x0010)  
	FName                                              __NameProperty36;                                           // 0x00E8   (0x0004)  
	int32_t                                            __IntProperty37;                                            // 0x00EC   (0x0004)  
	TArray<float>                                      __ArrayProperty38;                                          // 0x00F0   (0x0010)  
	TArray<float>                                      __ArrayProperty39;                                          // 0x0100   (0x0010)  
	FName                                              __NameProperty40;                                           // 0x0110   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty41;                                           // 0x0114   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0115   (0x0003)  MISSED
	FName                                              __NameProperty42;                                           // 0x0118   (0x0004)  
	FName                                              __NameProperty43;                                           // 0x011C   (0x0004)  
	FName                                              __NameProperty44;                                           // 0x0120   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0124   (0x0004)  MISSED
	class UBlendProfile*                               __BlendProfile;                                             // 0x0128   (0x0008)  
	class UCurveFloat*                                 __CurveFloat;                                               // 0x0130   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty45;                                           // 0x0138   (0x0001)  
	EBlendListTransitionType                           __EnumProperty46;                                           // 0x0139   (0x0001)  
	unsigned char                                      UnknownData05_5[0x6];                                       // 0x013A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty47;                                          // 0x0140   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0150   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0151   (0x0003)  MISSED
	float                                              __FloatProperty48;                                          // 0x0154   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0158   (0x002C)  
	float                                              __FloatProperty49;                                          // 0x0184   (0x0004)  
	bool                                               __BoolProperty50;                                           // 0x0188   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty51;                                           // 0x0189   (0x0001)  
	SDK_UNDEFINED(1,9445) /* TEnumAsByte<EAnimGroupRole> */ __um(__ByteProperty);                                  // 0x018A   (0x0001)  
	unsigned char                                      UnknownData07_5[0x1];                                       // 0x018B   (0x0001)  MISSED
	FName                                              __NameProperty52;                                           // 0x018C   (0x0004)  
	FName                                              __NameProperty53;                                           // 0x0190   (0x0004)  
	int32_t                                            __IntProperty54;                                            // 0x0194   (0x0004)  
	SDK_UNDEFINED(1,9446) /* TEnumAsByte<ERefPoseType> */ __um(__ByteProperty);                                    // 0x0198   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x0199   (0x0003)  MISSED
	FName                                              __NameProperty56;                                           // 0x019C   (0x0004)  
	FName                                              __NameProperty57;                                           // 0x01A0   (0x0004)  
	int32_t                                            __IntProperty58;                                            // 0x01A4   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty59;                                         // 0x01A8   (0x0018)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x01C0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0240   (0x0018)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root;                                         // 0x0258   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult;                             // 0x0288   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult60;                           // 0x02B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult61;                           // 0x02E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult62;                           // 0x0318   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult63;                           // 0x0348   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult64;                           // 0x0378   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult65;                           // 0x03A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer;                               // 0x03D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult;                                  // 0x0408   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer66;                             // 0x0438   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult67;                                // 0x0468   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer68;                             // 0x0498   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult69;                                // 0x04C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer70;                             // 0x04F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult71;                                // 0x0528   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine;                                 // 0x0558   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root72;                                       // 0x0588   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedInputPose;                              // 0x05B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer73;                             // 0x05E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer74;                             // 0x0618   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool;                              // 0x0648   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root75;                                       // 0x0678   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedInputPose76;                            // 0x06A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer77;                             // 0x06D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root78;                                       // 0x0708   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult79;                           // 0x0738   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult80;                           // 0x0768   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult81;                           // 0x0798   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult82;                           // 0x07C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult83;                           // 0x07F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult84;                           // 0x0828   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult85;                           // 0x0858   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult86;                           // 0x0888   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult87;                           // 0x08B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult88;                           // 0x08E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult89;                           // 0x0918   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult90;                           // 0x0948   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult91;                           // 0x0978   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult92;                           // 0x09A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult93;                           // 0x09D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult94;                           // 0x0A08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult95;                           // 0x0A38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult96;                           // 0x0A68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult97;                           // 0x0A98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult98;                           // 0x0AC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer99;                             // 0x0AF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult100;                               // 0x0B28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer101;                            // 0x0B58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult102;                               // 0x0B88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer103;                            // 0x0BB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult104;                               // 0x0BE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer105;                            // 0x0C18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult106;                               // 0x0C48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer107;                            // 0x0C78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult108;                               // 0x0CA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer109;                            // 0x0CD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult110;                               // 0x0D08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive;                                // 0x0D38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer;                             // 0x0D68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool111;                           // 0x0D98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer112;                            // 0x0DC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer113;                            // 0x0DF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult114;                               // 0x0E28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive115;                             // 0x0E58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer116;                          // 0x0E88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult117;                          // 0x0EB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult118;                          // 0x0EE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer119;                            // 0x0F18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult120;                               // 0x0F48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose;                                 // 0x0F78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult121;                               // 0x0FA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine122;                              // 0x0FD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive123;                             // 0x1008   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer124;                          // 0x1038   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult125;                               // 0x1068   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer126;                          // 0x1098   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer127;                            // 0x10C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer128;                            // 0x10F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose;                                // 0x1128   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool129;                           // 0x1158   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LayeredBoneBlend;                             // 0x1188   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive130;                             // 0x11B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool131;                           // 0x11E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose132;                             // 0x1218   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult133;                               // 0x1248   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine134;                              // 0x1278   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot;                                         // 0x12A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LocalToComponentSpace;                        // 0x12D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ComponentToLocalSpace;                        // 0x1308   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot135;                                      // 0x1338   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LegIK;                                        // 0x1368   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot136;                                      // 0x1398   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot137;                                      // 0x13C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SaveCachedPose;                               // 0x13F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose138;                             // 0x1428   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose139;                             // 0x1458   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool140;                           // 0x1488   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LayeredBoneBlend141;                          // 0x14B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose142;                             // 0x14E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot143;                                      // 0x1518   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive144;                             // 0x1548   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult145;                          // 0x1578   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult146;                          // 0x15A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult147;                          // 0x15D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult148;                          // 0x1608   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer149;                            // 0x1638   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult150;                               // 0x1668   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer151;                            // 0x1698   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult152;                               // 0x16C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose153;                              // 0x16F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult154;                               // 0x1728   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine155;                              // 0x1758   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer156;                            // 0x1788   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LayeredBoneBlend157;                          // 0x17B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x17E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        FortAnimGraphNode_WeightedLookAt;                           // 0x1818   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Inertialization;                              // 0x1848   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedAnimLayer;                              // 0x1878   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SaveCachedPose158;                            // 0x18A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer159;                            // 0x18D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool160;                           // 0x1908   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult161;                          // 0x1938   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult162;                          // 0x1968   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult163;                          // 0x1998   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult164;                          // 0x19C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult165;                          // 0x19F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult166;                          // 0x1A28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult167;                          // 0x1A58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult168;                          // 0x1A88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult169;                          // 0x1AB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult170;                          // 0x1AE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult171;                          // 0x1B18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult172;                          // 0x1B48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult173;                          // 0x1B78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult174;                          // 0x1BA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult175;                          // 0x1BD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult176;                          // 0x1C08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult177;                          // 0x1C38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult178;                          // 0x1C68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer179;                            // 0x1C98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer180;                            // 0x1CC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool181;                           // 0x1CF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult182;                               // 0x1D28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer183;                            // 0x1D58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer184;                            // 0x1D88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool185;                           // 0x1DB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult186;                               // 0x1DE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult187;                          // 0x1E18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult188;                          // 0x1E48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult189;                          // 0x1E78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult190;                          // 0x1EA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult191;                          // 0x1ED8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult192;                          // 0x1F08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult193;                          // 0x1F38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult194;                          // 0x1F68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer195;                            // 0x1F98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult196;                               // 0x1FC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer197;                            // 0x1FF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult198;                               // 0x2028   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer199;                            // 0x2058   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult200;                               // 0x2088   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer201;                            // 0x20B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult202;                               // 0x20E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult203;                          // 0x2118   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine204;                              // 0x2148   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult205;                               // 0x2178   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer206;                            // 0x21A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult207;                               // 0x21D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer208;                            // 0x2208   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult209;                               // 0x2238   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer210;                            // 0x2268   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult211;                               // 0x2298   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult212;                          // 0x22C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine213;                              // 0x22F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult214;                               // 0x2328   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer215;                            // 0x2358   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult216;                               // 0x2388   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer217;                            // 0x23B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive218;                             // 0x23E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer219;                          // 0x2418   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool220;                           // 0x2448   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer221;                            // 0x2478   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult222;                               // 0x24A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer223;                            // 0x24D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult224;                               // 0x2508   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer225;                            // 0x2538   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool226;                           // 0x2568   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive227;                             // 0x2598   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer228;                          // 0x25C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool229;                           // 0x25F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer230;                            // 0x2628   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer231;                            // 0x2658   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult232;                               // 0x2688   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive233;                             // 0x26B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer234;                          // 0x26E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer235;                            // 0x2718   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool236;                           // 0x2748   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer237;                            // 0x2778   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool238;                           // 0x27A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive239;                             // 0x27D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer240;                          // 0x2808   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive241;                             // 0x2838   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer242;                          // 0x2868   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult243;                          // 0x2898   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult244;                          // 0x28C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer245;                            // 0x28F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult246;                               // 0x2928   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose247;                              // 0x2958   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult248;                               // 0x2988   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine249;                              // 0x29B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive250;                             // 0x29E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer251;                          // 0x2A18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult252;                               // 0x2A48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer253;                            // 0x2A78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult254;                               // 0x2AA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine255;                              // 0x2AD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool256;                           // 0x2B08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot257;                                      // 0x2B38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive258;                             // 0x2B68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult259;                          // 0x2B98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult260;                          // 0x2BC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer261;                            // 0x2BF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult262;                               // 0x2C28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose263;                              // 0x2C58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult264;                               // 0x2C88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine265;                              // 0x2CB8   (0x0030)  
};

/// Struct /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0070 (0x000001 - 0x000071)
struct FAnimBlueprintGeneratedMutableDatadup_127 : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	bool                                               __BoolProperty0;                                            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              __FloatProperty1;                                           // 0x000C   (0x0004)  
	float                                              __FloatProperty2;                                           // 0x0010   (0x0004)  
	float                                              __FloatProperty3;                                           // 0x0014   (0x0004)  
	float                                              __FloatProperty4;                                           // 0x0018   (0x0004)  
	float                                              __FloatProperty5;                                           // 0x001C   (0x0004)  
	bool                                               __BoolProperty6;                                            // 0x0020   (0x0001)  
	bool                                               __BoolProperty7;                                            // 0x0021   (0x0001)  
	bool                                               __BoolProperty8;                                            // 0x0022   (0x0001)  
	bool                                               __BoolProperty9;                                            // 0x0023   (0x0001)  
	bool                                               __BoolProperty10;                                           // 0x0024   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0025   (0x0003)  MISSED
	float                                              __FloatProperty11;                                          // 0x0028   (0x0004)  
	float                                              __FloatProperty12;                                          // 0x002C   (0x0004)  
	bool                                               __BoolProperty13;                                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              __FloatProperty14;                                          // 0x0034   (0x0004)  
	float                                              __FloatProperty15;                                          // 0x0038   (0x0004)  
	bool                                               __BoolProperty16;                                           // 0x003C   (0x0001)  
	bool                                               __BoolProperty17;                                           // 0x003D   (0x0001)  
	unsigned char                                      UnknownData04_5[0x2];                                       // 0x003E   (0x0002)  MISSED
	float                                              __FloatProperty18;                                          // 0x0040   (0x0004)  
	bool                                               __BoolProperty19;                                           // 0x0044   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0045   (0x0003)  MISSED
	float                                              __FloatProperty20;                                          // 0x0048   (0x0004)  
	float                                              __FloatProperty21;                                          // 0x004C   (0x0004)  
	bool                                               __BoolProperty22;                                           // 0x0050   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0051   (0x0003)  MISSED
	float                                              __FloatProperty23;                                          // 0x0054   (0x0004)  
	bool                                               __BoolProperty24;                                           // 0x0058   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              __FloatProperty25;                                          // 0x005C   (0x0004)  
	float                                              __FloatProperty26;                                          // 0x0060   (0x0004)  
	float                                              __FloatProperty27;                                          // 0x0064   (0x0004)  
	float                                              __FloatProperty28;                                          // 0x0068   (0x0004)  
	float                                              __FloatProperty29;                                          // 0x006C   (0x0004)  
	bool                                               __BoolProperty30;                                           // 0x0070   (0x0001)  
};

