
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine

/// Enum /Script/ContextualAnimation.EContextualAnimCollisionBehavior
/// Size: 0x04
enum class EContextualAnimCollisionBehavior : uint8_t
{
	EContextualAnimCollisionBehavior__None                                           = 0,
	EContextualAnimCollisionBehavior__IgnoreActorWhenMoving                          = 1,
	EContextualAnimCollisionBehavior__IgnoreChannels                                 = 2,
	EContextualAnimCollisionBehavior__EContextualAnimCollisionBehavior_MAX           = 3
};

/// Enum /Script/ContextualAnimation.EContextualAnimPointType
/// Size: 0x04
enum class EContextualAnimPointType : uint8_t
{
	EContextualAnimPointType__FirstFrame                                             = 0,
	EContextualAnimPointType__SyncFrame                                              = 1,
	EContextualAnimPointType__LastFrame                                              = 2,
	EContextualAnimPointType__EContextualAnimPointType_MAX                           = 3
};

/// Enum /Script/ContextualAnimation.EContextualAnimCriterionToConsider
/// Size: 0x04
enum class EContextualAnimCriterionToConsider : uint8_t
{
	EContextualAnimCriterionToConsider__All                                          = 0,
	EContextualAnimCriterionToConsider__Spatial                                      = 1,
	EContextualAnimCriterionToConsider__Other                                        = 2,
	EContextualAnimCriterionToConsider__EContextualAnimCriterionToConsider_MAX       = 3
};

/// Enum /Script/ContextualAnimation.EContextualAnimActorPreviewType
/// Size: 0x05
enum class EContextualAnimActorPreviewType : uint8_t
{
	EContextualAnimActorPreviewType__SkeletalMesh                                    = 0,
	EContextualAnimActorPreviewType__StaticMesh                                      = 1,
	EContextualAnimActorPreviewType__Actor                                           = 2,
	EContextualAnimActorPreviewType__None                                            = 3,
	EContextualAnimActorPreviewType__EContextualAnimActorPreviewType_MAX             = 4
};

/// Enum /Script/ContextualAnimation.EContextualAnimCriterionType
/// Size: 0x03
enum class EContextualAnimCriterionType : uint8_t
{
	EContextualAnimCriterionType__Spatial                                            = 0,
	EContextualAnimCriterionType__Other                                              = 1,
	EContextualAnimCriterionType__EContextualAnimCriterionType_MAX                   = 2
};

/// Enum /Script/ContextualAnimation.EContextualAnimCriterionConeMode
/// Size: 0x03
enum class EContextualAnimCriterionConeMode : uint8_t
{
	EContextualAnimCriterionConeMode__ToPrimary                                      = 0,
	EContextualAnimCriterionConeMode__FromPrimary                                    = 1,
	EContextualAnimCriterionConeMode__EContextualAnimCriterionConeMode_MAX           = 2
};

/// Enum /Script/ContextualAnimation.EContextualAnimCriterionDistanceMode
/// Size: 0x03
enum class EContextualAnimCriterionDistanceMode : uint8_t
{
	EContextualAnimCriterionDistanceMode__Distance_3D                                = 0,
	EContextualAnimCriterionDistanceMode__Distance_2D                                = 1,
	EContextualAnimCriterionDistanceMode__Distance_MAX                               = 2
};

/// Enum /Script/ContextualAnimation.EContextualAnimJoinRule
/// Size: 0x03
enum class EContextualAnimJoinRule : uint8_t
{
	EContextualAnimJoinRule__Default                                                 = 0,
	EContextualAnimJoinRule__Late                                                    = 1,
	EContextualAnimJoinRule__EContextualAnimJoinRule_MAX                             = 2
};

/// Enum /Script/ContextualAnimation.EContextualAnimIKTargetProvider
/// Size: 0x03
enum class EContextualAnimIKTargetProvider : uint8_t
{
	EContextualAnimIKTargetProvider__Autogenerated                                   = 0,
	EContextualAnimIKTargetProvider__Bone                                            = 1,
	EContextualAnimIKTargetProvider__EContextualAnimIKTargetProvider_MAX             = 2
};

/// Enum /Script/ContextualAnimation.EContextualAnimWarpPointDefinitionMode
/// Size: 0x04
enum class EContextualAnimWarpPointDefinitionMode : uint8_t
{
	EContextualAnimWarpPointDefinitionMode__PrimaryActor                             = 0,
	EContextualAnimWarpPointDefinitionMode__Socket                                   = 1,
	EContextualAnimWarpPointDefinitionMode__Custom                                   = 2,
	EContextualAnimWarpPointDefinitionMode__EContextualAnimWarpPointDefinitionMode_MAX = 3
};

/// Class /Script/ContextualAnimation.AnimNotifyState_EarlyOutContextualAnimWindow
/// Size: 0x0000 (0x000030 - 0x000030)
class UAnimNotifyState_EarlyOutContextualAnimWindow : public UAnimNotifyState
{ 
public:
};

/// Class /Script/ContextualAnimation.AnimNotifyState_IKWindow
/// Size: 0x0070 (0x000030 - 0x0000A0)
class UAnimNotifyState_IKWindow : public UAnimNotifyState
{ 
public:
	FName                                              GoalName;                                                   // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0034   (0x0004)  MISSED
	FAlphaBlend                                        BlendIn;                                                    // 0x0038   (0x0030)  
	FAlphaBlend                                        BlendOut;                                                   // 0x0068   (0x0030)  
	bool                                               bEnable;                                                    // 0x0098   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0099   (0x0007)  MISSED
};

/// Class /Script/ContextualAnimation.ContextualAnimActorInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UContextualAnimActorInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/ContextualAnimation.ContextualAnimActorInterface.GetMesh
	// class USkeletalMeshComponent* GetMesh();                                                                              // [0x7e8b738] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
};

/// Struct /Script/ContextualAnimation.ContextualAnimRepData
/// Size: 0x0001 (0x000000 - 0x000001)
struct FContextualAnimRepData
{ 
	char                                               RepCounter;                                                 // 0x0000   (0x0001)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimSceneBindingContext
/// Size: 0x00E0 (0x000000 - 0x0000E0)
struct FContextualAnimSceneBindingContext
{ 
	SDK_UNDEFINED(8,1926) /* TWeakObjectPtr<AActor*> */ __um(Actor);                                               // 0x0000   (0x0008)  
	SDK_UNDEFINED(8,1927) /* TWeakObjectPtr<UContextualAnimSceneActorComponent*> */ __um(CachedSceneActorComp);    // 0x0008   (0x0008)  
	SDK_UNDEFINED(8,1928) /* TWeakObjectPtr<UAnimInstance*> */ __um(CachedAnimInstance);                           // 0x0010   (0x0008)  
	SDK_UNDEFINED(8,1929) /* TWeakObjectPtr<USkeletalMeshComponent*> */ __um(CachedSkeletalMesh);                  // 0x0018   (0x0008)  
	SDK_UNDEFINED(8,1930) /* TWeakObjectPtr<UCharacterMovementComponent*> */ __um(CachedMovementComp);             // 0x0020   (0x0008)  
	SDK_UNDEFINED(8,1931) /* TWeakObjectPtr<UMotionWarpingComponent*> */ __um(CachedMotionWarpingComp);            // 0x0028   (0x0008)  
	unsigned char                                      UnknownData00_6[0xB0];                                      // 0x0030   (0x00B0)  MISSED
};

/// Struct /Script/ContextualAnimation.ContextualAnimSceneBinding
/// Size: 0x00F0 (0x000000 - 0x0000F0)
struct FContextualAnimSceneBinding
{ 
	FContextualAnimSceneBindingContext                 Context;                                                    // 0x0000   (0x00E0)  
	int32_t                                            AnimTrackIdx;                                               // 0x00E0   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x00E4   (0x000C)  MISSED
};

/// Struct /Script/ContextualAnimation.ContextualAnimSceneBindings
/// Size: 0x0028 (0x000000 - 0x000028)
struct FContextualAnimSceneBindings
{ 
	char                                               ID;                                                         // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	class UContextualAnimSceneAsset*                   SceneAsset;                                                 // 0x0008   (0x0008)  
	int32_t                                            SectionIdx;                                                 // 0x0010   (0x0004)  
	int32_t                                            AnimSetIdx;                                                 // 0x0014   (0x0004)  
	TArray<FContextualAnimSceneBinding>                Data;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimWarpPoint
/// Size: 0x0070 (0x000000 - 0x000070)
struct FContextualAnimWarpPoint
{ 
	FName                                              Name;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0004   (0x000C)  MISSED
	FTransform                                         Transform;                                                  // 0x0010   (0x0060)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimWarpTarget
/// Size: 0x0040 (0x000000 - 0x000040)
struct FContextualAnimWarpTarget
{ 
	FName                                              Role;                                                       // 0x0000   (0x0004)  
	FName                                              TargetName;                                                 // 0x0004   (0x0004)  
	FVector                                            TargetLocation;                                             // 0x0008   (0x0018)  
	FQuat                                              TargetRotation;                                             // 0x0020   (0x0020)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimRepBindingsData
/// Size: 0x004F (0x000001 - 0x000050)
struct FContextualAnimRepBindingsData : FContextualAnimRepData
{ 
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0001   (0x0007)  MISSED
	FContextualAnimSceneBindings                       Bindings;                                                   // 0x0008   (0x0028)  
	TArray<FContextualAnimWarpPoint>                   WarpPoints;                                                 // 0x0030   (0x0010)  
	TArray<FContextualAnimWarpTarget>                  ExternalWarpTargets;                                        // 0x0040   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimRepLateJoinData
/// Size: 0x0037 (0x000001 - 0x000038)
struct FContextualAnimRepLateJoinData : FContextualAnimRepData
{ 
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0001   (0x0007)  MISSED
	class AActor*                                      Actor;                                                      // 0x0008   (0x0008)  
	FName                                              Role;                                                       // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<FContextualAnimWarpPoint>                   WarpPoints;                                                 // 0x0018   (0x0010)  
	TArray<FContextualAnimWarpTarget>                  ExternalWarpTargets;                                        // 0x0028   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimRepTransitionData
/// Size: 0x0027 (0x000001 - 0x000028)
struct FContextualAnimRepTransitionData : FContextualAnimRepData
{ 
	char                                               ID;                                                         // 0x0001   (0x0001)  
	char                                               SectionIdx;                                                 // 0x0002   (0x0001)  
	char                                               AnimSetIdx;                                                 // 0x0003   (0x0001)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FContextualAnimWarpPoint>                   WarpPoints;                                                 // 0x0008   (0x0010)  
	TArray<FContextualAnimWarpTarget>                  ExternalWarpTargets;                                        // 0x0018   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimIKTarget
/// Size: 0x0070 (0x000000 - 0x000070)
struct FContextualAnimIKTarget
{ 
	FName                                              GoalName;                                                   // 0x0000   (0x0004)  
	float                                              Alpha;                                                      // 0x0004   (0x0004)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0010   (0x0060)  
};

/// Class /Script/ContextualAnimation.ContextualAnimSceneActorComponent
/// Size: 0x01B0 (0x000500 - 0x0006B0)
class UContextualAnimSceneActorComponent : public UPrimitiveComponent
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x0500   (0x0008)  MISSED
	SDK_UNDEFINED(16,1932) /* FMulticastInlineDelegate */ __um(OnJoinedSceneDelegate);                             // 0x0508   (0x0010)  
	SDK_UNDEFINED(16,1933) /* FMulticastInlineDelegate */ __um(OnLeftSceneDelegate);                               // 0x0518   (0x0010)  
	SDK_UNDEFINED(16,1934) /* FMulticastInlineDelegate */ __um(OnPlayMontageNotifyBeginDelegate);                  // 0x0528   (0x0010)  
	class UContextualAnimSceneAsset*                   SceneAsset;                                                 // 0x0538   (0x0008)  
	bool                                               bEnableDebug;                                               // 0x0540   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0541   (0x0007)  MISSED
	FContextualAnimRepBindingsData                     RepBindings;                                                // 0x0548   (0x0050)  
	FContextualAnimRepLateJoinData                     RepLateJoinData;                                            // 0x0598   (0x0038)  
	FContextualAnimRepTransitionData                   RepTransitionData;                                          // 0x05D0   (0x0028)  
	FContextualAnimRepTransitionData                   RepTransitionSingleActorData;                               // 0x05F8   (0x0028)  
	FContextualAnimSceneBindings                       Bindings;                                                   // 0x0620   (0x0028)  
	TArray<FContextualAnimIKTarget>                    IKTargets;                                                  // 0x0648   (0x0010)  
	unsigned char                                      UnknownData02_6[0x58];                                      // 0x0658   (0x0058)  MISSED


	/// Functions
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.TransitionSingleActor
	// bool TransitionSingleActor(int32_t SectionIdx, int32_t AnimSetIdx);                                                   // [0x7e8c260] Final|Native|Public|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.TransitionContextualAnimScene
	// bool TransitionContextualAnimScene(FName SectionName);                                                                // [0x7e8c1d4] Final|Native|Public|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.StartContextualAnimScene
	// bool StartContextualAnimScene(FContextualAnimSceneBindings& InBindings);                                              // [0x7e8c11c] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.ServerStartContextualAnimScene
	// void ServerStartContextualAnimScene(FContextualAnimSceneBindings InBindings);                                         // [0x7e8bfa4] Net|NetReliableNative|Event|Protected|NetServer|NetValidate 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.ServerEarlyOutContextualAnimScene
	// void ServerEarlyOutContextualAnimScene();                                                                             // [0x7e8bf58] Net|NetReliableNative|Event|Protected|NetServer|NetValidate 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnTickPose
	// void OnTickPose(class USkinnedMeshComponent* SkinnedMeshComponent, float DeltaTime, bool bNeedsValidRootMotion);      // [0x7e8bbfc] Native|Protected     
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnRep_TransitionData
	// void OnRep_TransitionData();                                                                                          // [0x7e8bbe8] Final|Native|Protected 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnRep_RepTransitionSingleActor
	// void OnRep_RepTransitionSingleActor();                                                                                // [0x7e8bbd4] Final|Native|Protected 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnRep_LateJoinData
	// void OnRep_LateJoinData();                                                                                            // [0x7e8bbc0] Final|Native|Protected 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnRep_Bindings
	// void OnRep_Bindings();                                                                                                // [0x7e8bbac] Final|Native|Protected 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnPlayMontageNotifyBegin
	// void OnPlayMontageNotifyBegin(FName NotifyName, FBranchingPointNotifyPayload& BranchingPointNotifyPayload);           // [0x7e8bacc] Final|Native|Protected|HasOutParms 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnMontageBlendingOut
	// void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);                                            // [0x7e8ba04] Final|Native|Protected 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnLeftScene
	// void OnLeftScene();                                                                                                   // [0x36203b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.OnJoinedScene
	// void OnJoinedScene(FContextualAnimSceneBindings& InBindings);                                                         // [0x7e8b97c] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.LateJoinContextualAnimScene
	// bool LateJoinContextualAnimScene(class AActor* Actor, FName Role);                                                    // [0x7e8b8b8] Final|Native|Public|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.IsInActiveScene
	// bool IsInActiveScene();                                                                                               // [0x7e8b860] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.GetIKTargets
	// TArray<FContextualAnimIKTarget> GetIKTargets();                                                                       // [0x7e8b6c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.GetIKTargetByGoalName
	// FContextualAnimIKTarget GetIKTargetByGoalName(FName GoalName);                                                        // [0x7e8b5dc] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneActorComponent.EarlyOutContextualAnimScene
	// void EarlyOutContextualAnimScene();                                                                                   // [0x7e8af2c] Final|Native|Public|BlueprintCallable 
};

/// Struct /Script/ContextualAnimation.ContextualAnimRoleDefinition
/// Size: 0x0070 (0x000000 - 0x000070)
struct FContextualAnimRoleDefinition
{ 
	FName                                              Name;                                                       // 0x0000   (0x0004)  
	bool                                               bIsCharacter;                                               // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0005   (0x0003)  MISSED
	float                                              PreviewCapsuleHalfHeight;                                   // 0x0008   (0x0004)  
	float                                              PreviewCapsuleRadius;                                       // 0x000C   (0x0004)  
	FTransform                                         MeshToComponent;                                            // 0x0010   (0x0060)  
};

/// Class /Script/ContextualAnimation.ContextualAnimRolesAsset
/// Size: 0x0010 (0x000030 - 0x000040)
class UContextualAnimRolesAsset : public UDataAsset
{ 
public:
	TArray<FContextualAnimRoleDefinition>              Roles;                                                      // 0x0030   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimAlignmentTrackContainer
/// Size: 0x0028 (0x000000 - 0x000028)
struct FContextualAnimAlignmentTrackContainer
{ 
	FAnimSequenceTrackContainer                        Tracks;                                                     // 0x0000   (0x0020)  
	float                                              SampleInterval;                                             // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/ContextualAnimation.ContextualAnimTrack
/// Size: 0x00E0 (0x000000 - 0x0000E0)
struct FContextualAnimTrack
{ 
	class UAnimSequenceBase*                           Animation;                                                  // 0x0000   (0x0008)  
	float                                              AnimMaxStartTime;                                           // 0x0008   (0x0004)  
	SDK_UNDEFINED(1,1935) /* TEnumAsByte<EMovementMode> */ __um(MovementMode);                                     // 0x000C   (0x0001)  
	bool                                               bOptional;                                                  // 0x000D   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x000E   (0x0002)  MISSED
	FContextualAnimAlignmentTrackContainer             AlignmentData;                                              // 0x0010   (0x0028)  
	FContextualAnimAlignmentTrackContainer             IKTargetData;                                               // 0x0038   (0x0028)  
	TArray<class UContextualAnimSelectionCriterion*>   SelectionCriteria;                                          // 0x0060   (0x0010)  
	FTransform                                         MeshToScene;                                                // 0x0070   (0x0060)  
	FName                                              Role;                                                       // 0x00D0   (0x0004)  
	int32_t                                            SectionIdx;                                                 // 0x00D4   (0x0004)  
	int32_t                                            AnimSetIdx;                                                 // 0x00D8   (0x0004)  
	int32_t                                            AnimTrackIdx;                                               // 0x00DC   (0x0004)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimSet
/// Size: 0x0068 (0x000000 - 0x000068)
struct FContextualAnimSet
{ 
	TArray<FContextualAnimTrack>                       Tracks;                                                     // 0x0000   (0x0010)  
	SDK_UNDEFINED(80,1936) /* TMap<FName, FTransform> */ __um(WarpPoints);                                         // 0x0010   (0x0050)  
	float                                              RandomWeight;                                               // 0x0060   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0064   (0x0004)  MISSED
};

/// Struct /Script/ContextualAnimation.ContextualAnimWarpPointCustomParams
/// Size: 0x0010 (0x000000 - 0x000010)
struct FContextualAnimWarpPointCustomParams
{ 
	FName                                              Origin;                                                     // 0x0000   (0x0004)  
	bool                                               bAlongClosestDistance;                                      // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0005   (0x0003)  MISSED
	FName                                              OtherRole;                                                  // 0x0008   (0x0004)  
	float                                              Weight;                                                     // 0x000C   (0x0004)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimWarpPointDefinition
/// Size: 0x001C (0x000000 - 0x00001C)
struct FContextualAnimWarpPointDefinition
{ 
	FName                                              WarpTargetName;                                             // 0x0000   (0x0004)  
	EContextualAnimWarpPointDefinitionMode             Mode;                                                       // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0005   (0x0003)  MISSED
	FName                                              SocketName;                                                 // 0x0008   (0x0004)  
	FContextualAnimWarpPointCustomParams               Params;                                                     // 0x000C   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimSceneSection
/// Size: 0x0078 (0x000000 - 0x000078)
struct FContextualAnimSceneSection
{ 
	FName                                              Name;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FContextualAnimSet>                         AnimSets;                                                   // 0x0008   (0x0010)  
	SDK_UNDEFINED(80,1937) /* TMap<FName, FContextualAnimIKTargetDefContainer> */ __um(RoleToIKTargetDefsMap);     // 0x0018   (0x0050)  
	TArray<FContextualAnimWarpPointDefinition>         WarpPointDefinitions;                                       // 0x0068   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimIgnoreChannelsParam
/// Size: 0x0018 (0x000000 - 0x000018)
struct FContextualAnimIgnoreChannelsParam
{ 
	FName                                              Role;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	SDK_UNDEFINED(16,1938) /* TArray<TEnumAsByte<ECollisionChannel>> */ __um(Channels);                            // 0x0008   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimAttachmentParams
/// Size: 0x0070 (0x000000 - 0x000070)
struct FContextualAnimAttachmentParams
{ 
	FName                                              Role;                                                       // 0x0000   (0x0004)  
	FName                                              SocketName;                                                 // 0x0004   (0x0004)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         RelativeTransform;                                          // 0x0010   (0x0060)  
};

/// Class /Script/ContextualAnimation.ContextualAnimSceneAsset
/// Size: 0x0050 (0x000030 - 0x000080)
class UContextualAnimSceneAsset : public UDataAsset
{ 
public:
	class UContextualAnimRolesAsset*                   RolesAsset;                                                 // 0x0030   (0x0008)  
	FName                                              PrimaryRole;                                                // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x003C   (0x0004)  MISSED
	TArray<FContextualAnimSceneSection>                Sections;                                                   // 0x0040   (0x0010)  
	float                                              Radius;                                                     // 0x0050   (0x0004)  
	EContextualAnimCollisionBehavior                   CollisionBehavior;                                          // 0x0054   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0055   (0x0003)  MISSED
	TArray<FContextualAnimIgnoreChannelsParam>         CollisionChannelsToIgnoreParams;                            // 0x0058   (0x0010)  
	TArray<FContextualAnimAttachmentParams>            AttachmentParams;                                           // 0x0068   (0x0010)  
	bool                                               bPrecomputeAlignmentTracks;                                 // 0x0078   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0079   (0x0003)  MISSED
	int32_t                                            SampleRate;                                                 // 0x007C   (0x0004)  


	/// Functions
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.Query
	// bool Query(FName Role, FContextualAnimQueryResult& OutResult, FContextualAnimQueryParams& QueryParams, FTransform& ToWorldTransform); // [0x7e8bcfc] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.GetRoles
	// TArray<FName> GetRoles();                                                                                             // [0x7e8b760] Final|Native|Public|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.GetAlignmentPointsForSecondaryRoleConsideringSelectionCriteria
	// void GetAlignmentPointsForSecondaryRoleConsideringSelectionCriteria(EContextualAnimPointType Type, int32_t SectionIdx, FContextualAnimSceneBindingContext& Primary, FContextualAnimSceneBindingContext& Querier, EContextualAnimCriterionToConsider CriterionToConsider, TArray<FContextualAnimPoint>& OutResult); // [0x7e8b1e0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.GetAlignmentPointsForSecondaryRole
	// void GetAlignmentPointsForSecondaryRole(EContextualAnimPointType Type, int32_t SectionIdx, FContextualAnimSceneBindingContext& Primary, TArray<FContextualAnimPoint>& OutResult); // [0x7e8af40] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.BP_GetStartAndEndTimeForWarpSection
	// void BP_GetStartAndEndTimeForWarpSection(int32_t SectionIdx, int32_t AnimSetIdx, FName Role, FName WarpSectionName, float& OutStartTime, float& OutEndTime); // [0x7e8875c] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.BP_GetIKTargetTransformForRoleAtTime
	// FTransform BP_GetIKTargetTransformForRoleAtTime(int32_t SectionIdx, int32_t AnimSetIdx, FName Role, FName TrackName, float Time); // [0x7e885a0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.BP_GetAlignmentTransformForRoleRelativeToWarpPoint
	// FTransform BP_GetAlignmentTransformForRoleRelativeToWarpPoint(int32_t SectionIdx, int32_t AnimSetIdx, FName Role, float Time); // [0x7e8840c] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.BP_FindAnimSetIndexByAnimation
	// int32_t BP_FindAnimSetIndexByAnimation(int32_t SectionIdx, class UAnimSequenceBase* Animation);                       // [0x7e881d8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSceneAsset.BP_FindAnimationForRole
	// class UAnimSequenceBase* BP_FindAnimationForRole(int32_t SectionIdx, int32_t AnimSetIdx, FName Role);                 // [0x7e882f8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/ContextualAnimation.ContextualAnimSelectionCriterion
/// Size: 0x0008 (0x000028 - 0x000030)
class UContextualAnimSelectionCriterion : public UObject
{ 
public:
	unsigned char                                      UnknownData00_3[0x28];                                      // 0x0000   (0x0028)  MISSED
	EContextualAnimCriterionType                       Type;                                                       // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/ContextualAnimation.ContextualAnimSelectionCriterion_Blueprint
/// Size: 0x0000 (0x000030 - 0x000030)
class UContextualAnimSelectionCriterion_Blueprint : public UContextualAnimSelectionCriterion
{ 
public:


	/// Functions
	// Function /Script/ContextualAnimation.ContextualAnimSelectionCriterion_Blueprint.GetSceneAsset
	// class UContextualAnimSceneAsset* GetSceneAsset();                                                                     // [0x7e8b818] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/ContextualAnimation.ContextualAnimSelectionCriterion_Blueprint.BP_DoesQuerierPassCondition
	// bool BP_DoesQuerierPassCondition(FContextualAnimSceneBindingContext& Primary, FContextualAnimSceneBindingContext& Querier); // [0x18a39e4] Event|Public|HasOutParms|BlueprintEvent|Const 
};

/// Class /Script/ContextualAnimation.ContextualAnimSelectionCriterion_TriggerArea
/// Size: 0x0018 (0x000030 - 0x000048)
class UContextualAnimSelectionCriterion_TriggerArea : public UContextualAnimSelectionCriterion
{ 
public:
	TArray<FVector>                                    PolygonPoints;                                              // 0x0030   (0x0010)  
	float                                              Height;                                                     // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Class /Script/ContextualAnimation.ContextualAnimSelectionCriterion_Cone
/// Size: 0x0010 (0x000030 - 0x000040)
class UContextualAnimSelectionCriterion_Cone : public UContextualAnimSelectionCriterion
{ 
public:
	EContextualAnimCriterionConeMode                   Mode;                                                       // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              Distance;                                                   // 0x0034   (0x0004)  
	float                                              HalfAngle;                                                  // 0x0038   (0x0004)  
	float                                              Offset;                                                     // 0x003C   (0x0004)  
};

/// Class /Script/ContextualAnimation.ContextualAnimSelectionCriterion_Distance
/// Size: 0x0010 (0x000030 - 0x000040)
class UContextualAnimSelectionCriterion_Distance : public UContextualAnimSelectionCriterion
{ 
public:
	EContextualAnimCriterionDistanceMode               Mode;                                                       // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              MinDistance;                                                // 0x0034   (0x0004)  
	float                                              MaxDistance;                                                // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Class /Script/ContextualAnimation.ContextualAnimUtilities
/// Size: 0x0000 (0x000028 - 0x000028)
class UContextualAnimUtilities : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetSectionAndAnimSetIndices
	// void BP_SceneBindings_GetSectionAndAnimSetIndices(FContextualAnimSceneBindings& Bindings, int32_t& SectionIdx, int32_t& AnimSetIdx); // [0x7e8ad2c] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetSceneAsset
	// class UContextualAnimSceneAsset* BP_SceneBindings_GetSceneAsset(FContextualAnimSceneBindings& Bindings);              // [0x7e8ac80] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetBindings
	// TArray<FContextualAnimSceneBinding> BP_SceneBindings_GetBindings(FContextualAnimSceneBindings& Bindings);             // [0x7e8abd0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetBindingByRole
	// FContextualAnimSceneBinding BP_SceneBindings_GetBindingByRole(FContextualAnimSceneBindings& Bindings, FName Role);    // [0x7e8aa20] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetBindingByActor
	// FContextualAnimSceneBinding BP_SceneBindings_GetBindingByActor(FContextualAnimSceneBindings& Bindings, class AActor* Actor); // [0x7e8a868] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetAlignmentTransformFromBinding
	// FTransform BP_SceneBindings_GetAlignmentTransformFromBinding(FContextualAnimSceneBindings& Bindings, FContextualAnimSceneBinding& Binding, FContextualAnimWarpPoint& WarpPoint); // [0x7e8a66c] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetAlignmentTransformForRoleRelativeToWarpPoint
	// FTransform BP_SceneBindings_GetAlignmentTransformForRoleRelativeToWarpPoint(FContextualAnimSceneBindings& Bindings, FName Role, FContextualAnimWarpPoint& WarpPoint, float Time); // [0x7e8a324] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_GetAlignmentTransformForRoleRelativeToOtherRole
	// FTransform BP_SceneBindings_GetAlignmentTransformForRoleRelativeToOtherRole(FContextualAnimSceneBindings& Bindings, FName Role, FName RelativeToRole, float Time); // [0x7e89f98] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_CalculateWarpPoints
	// void BP_SceneBindings_CalculateWarpPoints(FContextualAnimSceneBindings& Bindings, TArray<FContextualAnimWarpPoint>& OutWarpPoints); // [0x7e89db8] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindings_AddOrUpdateWarpTargetsForBindings
	// void BP_SceneBindings_AddOrUpdateWarpTargetsForBindings(FContextualAnimSceneBindings& Bindings);                      // [0x7e89d1c] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_MakeFromActorWithExternalTransform
	// FContextualAnimSceneBindingContext BP_SceneBindingContext_MakeFromActorWithExternalTransform(class AActor* Actor, FTransform ExternalTransform); // [0x7e895f4] Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_MakeFromActor
	// FContextualAnimSceneBindingContext BP_SceneBindingContext_MakeFromActor(class AActor* Actor);                         // [0x7e89518] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_HasMatchingGameplayTag
	// bool BP_SceneBindingContext_HasMatchingGameplayTag(FContextualAnimSceneBindingContext& BindingContext, FGameplayTag& TagToCheck); // [0x7e89358] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_HasAnyMatchingGameplayTags
	// bool BP_SceneBindingContext_HasAnyMatchingGameplayTags(FContextualAnimSceneBindingContext& BindingContext, FGameplayTagContainer& TagContainer); // [0x7e891e8] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_HasAllMatchingGameplayTags
	// bool BP_SceneBindingContext_HasAllMatchingGameplayTags(FContextualAnimSceneBindingContext& BindingContext, FGameplayTagContainer& TagContainer); // [0x7e89040] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_GetVelocity
	// FVector BP_SceneBindingContext_GetVelocity(FContextualAnimSceneBindingContext& BindingContext);                       // [0x7e88f08] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_GetTransform
	// FTransform BP_SceneBindingContext_GetTransform(FContextualAnimSceneBindingContext& BindingContext);                   // [0x7e88df8] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_GetGameplayTags
	// FGameplayTagContainer BP_SceneBindingContext_GetGameplayTags(FContextualAnimSceneBindingContext& BindingContext);     // [0x7e88d0c] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBindingContext_GetActor
	// class AActor* BP_SceneBindingContext_GetActor(FContextualAnimSceneBindingContext& BindingContext);                    // [0x7e88c28] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBinding_GetSkeletalMesh
	// class USkeletalMeshComponent* BP_SceneBinding_GetSkeletalMesh(FContextualAnimSceneBinding& Binding);                  // [0x7e89bdc] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBinding_GetRoleFromBinding
	// FName BP_SceneBinding_GetRoleFromBinding(FContextualAnimSceneBindings& Bindings, FContextualAnimSceneBinding& Binding); // [0x7e89a6c] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBinding_GetAnimationFromBinding
	// class UAnimSequenceBase* BP_SceneBinding_GetAnimationFromBinding(FContextualAnimSceneBindings& Bindings, FContextualAnimSceneBinding& Binding); // [0x7e89904] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_SceneBinding_GetActor
	// class AActor* BP_SceneBinding_GetActor(FContextualAnimSceneBinding& Binding);                                         // [0x7e8981c] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_Montage_GetSectionTimeLeftFromPos
	// float BP_Montage_GetSectionTimeLeftFromPos(class UAnimMontage* Montage, float Position);                              // [0x7e88b5c] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_Montage_GetSectionStartAndEndTime
	// void BP_Montage_GetSectionStartAndEndTime(class UAnimMontage* Montage, int32_t SectionIndex, float& OutStartTime, float& OutEndTime); // [0x7e88a0c] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_Montage_GetSectionLength
	// float BP_Montage_GetSectionLength(class UAnimMontage* Montage, int32_t SectionIndex);                                 // [0x7e88940] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_DrawDebugPose
	// void BP_DrawDebugPose(class UObject* WorldContextObject, class UAnimSequenceBase* Animation, float Time, FTransform LocalToWorldTransform, FLinearColor Color, float Lifetime, float Thickness); // [0x7e87cb0] Final|Native|Static|Public|HasDefaults|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_CreateContextualAnimSceneBindingsForTwoActors
	// bool BP_CreateContextualAnimSceneBindingsForTwoActors(class UContextualAnimSceneAsset* SceneAsset, FContextualAnimSceneBindingContext& Primary, FContextualAnimSceneBindingContext& Secondary, FContextualAnimSceneBindings& OutBindings); // [0x7e87a6c] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/ContextualAnimation.ContextualAnimUtilities.BP_CreateContextualAnimSceneBindings
	// bool BP_CreateContextualAnimSceneBindings(class UContextualAnimSceneAsset* SceneAsset, TMap<FName, FContextualAnimSceneBindingContext>& Params, FContextualAnimSceneBindings& OutBindings); // [0x7e878e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Struct /Script/ContextualAnimation.ContextualAnimIKTargetDefinition
/// Size: 0x0014 (0x000000 - 0x000014)
struct FContextualAnimIKTargetDefinition
{ 
	FName                                              GoalName;                                                   // 0x0000   (0x0004)  
	FName                                              BoneName;                                                   // 0x0004   (0x0004)  
	EContextualAnimIKTargetProvider                    Provider;                                                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	FName                                              TargetRoleName;                                             // 0x000C   (0x0004)  
	FName                                              TargetBoneName;                                             // 0x0010   (0x0004)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimIKTargetDefContainer
/// Size: 0x0010 (0x000000 - 0x000010)
struct FContextualAnimIKTargetDefContainer
{ 
	TArray<FContextualAnimIKTargetDefinition>          IKTargetDefs;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimPoint
/// Size: 0x0080 (0x000000 - 0x000080)
struct FContextualAnimPoint
{ 
	FName                                              Role;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0xC];                                       // 0x0004   (0x000C)  MISSED
	FTransform                                         Transform;                                                  // 0x0010   (0x0060)  
	float                                              Speed;                                                      // 0x0070   (0x0004)  
	int32_t                                            SectionIdx;                                                 // 0x0074   (0x0004)  
	int32_t                                            AnimSetIdx;                                                 // 0x0078   (0x0004)  
	int32_t                                            AnimTrackIdx;                                               // 0x007C   (0x0004)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimActorPreviewData
/// Size: 0x0088 (0x000000 - 0x000088)
struct FContextualAnimActorPreviewData
{ 
	FName                                              Role;                                                       // 0x0000   (0x0004)  
	EContextualAnimActorPreviewType                    Type;                                                       // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0005   (0x0003)  MISSED
	SDK_UNDEFINED(32,1939) /* TWeakObjectPtr<USkeletalMesh*> */ __um(PreviewSkeletalMesh);                         // 0x0008   (0x0020)  
	SDK_UNDEFINED(32,1940) /* TWeakObjectPtr<UClass*> */ __um(PreviewAnimInstance);                                // 0x0028   (0x0020)  
	SDK_UNDEFINED(32,1941) /* TWeakObjectPtr<UStaticMesh*> */ __um(PreviewStaticMesh);                             // 0x0048   (0x0020)  
	SDK_UNDEFINED(32,1942) /* TWeakObjectPtr<UClass*> */ __um(PreviewActorClass);                                  // 0x0068   (0x0020)  
};

/// Struct /Script/ContextualAnimation.ContextualAnimStartSceneParams
/// Size: 0x0068 (0x000000 - 0x000068)
struct FContextualAnimStartSceneParams
{ 
	SDK_UNDEFINED(80,1943) /* TMap<FName, FContextualAnimSceneBindingContext> */ __um(RoleToActorMap);             // 0x0000   (0x0050)  
	int32_t                                            SectionIdx;                                                 // 0x0050   (0x0004)  
	int32_t                                            AnimSetIdx;                                                 // 0x0054   (0x0004)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0058   (0x0010)  MISSED
};

/// Struct /Script/ContextualAnimation.ContextualAnimQueryResult
/// Size: 0x00E0 (0x000000 - 0x0000E0)
struct FContextualAnimQueryResult
{ 
	SDK_UNDEFINED(8,1944) /* TWeakObjectPtr<UAnimMontage*> */ __um(Animation);                                     // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         EntryTransform;                                             // 0x0010   (0x0060)  
	FTransform                                         SyncTransform;                                              // 0x0070   (0x0060)  
	float                                              AnimStartTime;                                              // 0x00D0   (0x0004)  
	int32_t                                            AnimSetIdx;                                                 // 0x00D4   (0x0004)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x00D8   (0x0008)  MISSED
};

/// Struct /Script/ContextualAnimation.ContextualAnimQueryParams
/// Size: 0x0080 (0x000000 - 0x000080)
struct FContextualAnimQueryParams
{ 
	SDK_UNDEFINED(8,1945) /* TWeakObjectPtr<AActor*> */ __um(Querier);                                             // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         QueryTransform;                                             // 0x0010   (0x0060)  
	bool                                               bComplexQuery;                                              // 0x0070   (0x0001)  
	bool                                               bFindAnimStartTime;                                         // 0x0071   (0x0001)  
	unsigned char                                      UnknownData01_6[0xE];                                       // 0x0072   (0x000E)  MISSED
};

