
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: DeveloperSettings
/// dependency: Engine

/// Class /Script/FortniteEngineLoadingScreen.FortniteUserInterfaceSettings
/// Size: 0x0550 (0x000030 - 0x000580)
class UFortniteUserInterfaceSettings : public UDeveloperSettings
{ 
public:
	FRuntimeFloatCurve                                 WidthScaleCurve;                                            // 0x0030   (0x0088)  
	FRuntimeFloatCurve                                 HeightScaleCurve;                                           // 0x00B8   (0x0088)  
	FRuntimeFloatCurve                                 WidthScaleCurve_iOS_InGame;                                 // 0x0140   (0x0088)  
	FRuntimeFloatCurve                                 HeightScaleCurve_iOS_InGame;                                // 0x01C8   (0x0088)  
	FRuntimeFloatCurve                                 WidthScaleCurve_iOS_FrontEnd;                               // 0x0250   (0x0088)  
	FRuntimeFloatCurve                                 HeightScaleCurve_iOS_FrontEnd;                              // 0x02D8   (0x0088)  
	FRuntimeFloatCurve                                 WidthScaleCurve_Android_InGame;                             // 0x0360   (0x0088)  
	FRuntimeFloatCurve                                 HeightScaleCurve_Android_InGame;                            // 0x03E8   (0x0088)  
	FRuntimeFloatCurve                                 WidthScaleCurve_Android_FrontEnd;                           // 0x0470   (0x0088)  
	FRuntimeFloatCurve                                 HeightScaleCurve_Android_FrontEnd;                          // 0x04F8   (0x0088)  
};

